# Lesson ------------------------------------------------------------------

#Step 2: Variable assiment
my_var1  <- 42
my_var2  <- 35.25

my_var1 + 100
my_var1 + my_var2 - 12
my_var3  <- my_var1^2 + my_var2^2

#Step 3: Logical opperartions
my_var3 > 200
my_var3 > 3009
my_var1 == my_var2
my_var1 != my_var2
my_var3 >= 200
my_var3 <= 200

my_new_var  <- my_var1 == my_var2


#Step 6, 7, 10, 11: Vectors
# запись вектора
1 : 67
my_vector1  <- 1:67
my_vector2  <- c(-32, 45, 67, 12.78, 129, 0, -65)

# вывод по индексу
my_vector1[1]
my_vector1[3]

my_vector2[2]

# вывод по индексам. 2 вида записи
my_vector2[c(1,2,3)]
my_vector2[1:3]
my_vector2[c(1,5,6,7,10)]

# операция с каждым членом вектора или векторизация
my_vector1 + 10
my_vector2 + 56

# сравнение с каждым членом вектора
my_vector2 == 0
my_vector1 > 30

x  <- 23
my_vector1 > 23
x == 23

# срвнение с нулм
my_vector2 > 0
# вывод по условию
my_vector2[my_vector2 > 0] 
my_vector2[my_vector2 < 0]
my_vector2[my_vector2 == 0]

# вывод по условия И
my_vector1[my_vector1 > 20 & my_vector1 < 30]
my_numbers  <- my_vector1[my_vector1 > 20 & my_vector1 < 30]
positive_numbers  <- my_vector2[my_vector2 > 0]


v1  <- c(165, 178, 180, 181, 167, 178, 187, 167, 187)
mean_v1  <- mean(v1)
# вывод по всего, что больше средего значения
v1[v1 > mean_v1]
greater_than_mean  <- v1[v1 > mean_v1]


#Step 13: Lists and dataframes
age  <- c(16, 18, 22, 27)
is_maried  <- c(F, F, T, T)
name  <- c("Olga", "Maria", "Nastya", "Polina")

my_data  <- data.frame(Name = name, Age = age, Status = is_maried)


# Tasks ------------------------------------------------------------------

## Task1 ------------------------------------------------------------------
# Провести тестовый ввод
my_number <- 42
my_logical_var <- TRUE 

## Task2 ------------------------------------------------------------------

# Сначала в невидимой для вас части кода мы сохраняем 
# в var_1 случайно выбранное число, например:
var_1 <- 100

# Теперь мы исполняем ваш код, который вы прислали на проверку:
var_2 <- var_1 * 10

# Потом мы проверяем, действительно ли в переменной var_2 
# хранится нужное значение.

# Если все верно, повторяем эту процедуру с другими значениями
# переменной var_1.
# Если в переменной var_2 оказалось неправильное значение, 
# сообщаем Вам об ошибке.

## Task3 ------------------------------------------------------------------


## Task4 ------------------------------------------------------------------


## Task5 ------------------------------------------------------------------


## Task6 ------------------------------------------------------------------


## Task7 ------------------------------------------------------------------


## Task8 ------------------------------------------------------------------
